(function(){
  var images = {
    "вночі": "img/vnochi.png",
    "любові": "img/lubovi.png",
    "війна": "img/vijna.png",
    "нічого": "img/nichogo.png",
    "ніжні": "img/nizhni.png",
    "ніч": "img/nich.png",
    "любов’ю": "img/luboviu.png",
    "ночі": "img/nochi.png",
    "ніжно": "img/nizhno.png",
    "нічне": "img/nichne.png",
    "ніжності": "img/nizhnosti.png",
    "ночами": "img/nochamy.png",
    "любов": "img/lubov.png",
    "ніжність": "img/nizhnist.png",
    "нічний": "img/nichny.png",
    "ночей": "img/nochey.png",
    "нічні": "img/nichni.png",
    "нічних": "img/nichnyh.png",
    "ніжними": "img/nizhnymy.png"
  }

  var slots, circle, play;

  var mainWords = ["вночі", "нічого", "любові", "ніжні",  "війна", "любов", "любов’ю"];
  // var mainWords = ["вночі", "нічого", "ніч", "любові", "ніжні", "війна", "любов’ю", "ніжності", "ночі"]

  var combos = [
    {
      video: "2s5W5dxcs2w", words: ["вночі", "ночі", "ніжно"],
      text: [
        {words: "вночі він написав їй повідомлення", time: 0},
        {words: "коли над вулицями в липкому повітрі проносяться демони", time: 20},
        {words: "дим на кухнях гусне, пахнучи маком і шоколадом", time: 23},
        {words: "серед бузкової ночі вогні її помешкання", time: 28},
        {words: "провалюється у свої сновидіння, ніби в крихкий і невагомий різдвяний сніг", time: 35},
        {words: "доки кристали морозу запікаються їй на вустах", time: 42},
        {words: "він несе свою вахту, охороняючи її спокій і розганяючи демонів своїми кубинськими сигаретами", time: 44},
        {words: "вулиці нині особливо лункі", time: 51},
        {words: "хочеться говорити тихо, щоби тебе ніхто не почув, а почувши – не зрозумів", time: 64},
      ]
    },
    {
      video: "rBMrX4gfwwI", words: ["нічого", "ніч", "нічне", "ніжності", "любові"],
      text: [
        {words: "щє нічого немає", time: 0},
        {words: "зелена ніч, і в кожної тиші міра своя", time: 10},
        {words: "знаючи, скільки потрібно сторіч, щоби з'явилась найперша річ, він вимовляє її ім'я", time: 13},
        {words: "відчиняє нічне вікно і ловить напружено кожен рух", time: 21},
        {words: "сподіваючись на щось все одно", time: 25},
        {words: "небуття важке полотно покірно дається йому до рук", time: 27},
        {words: "гольфстріми, айсберги мертвих морів", time: 32},
        {words: "щоденний рух повітряних сфер", time: 35},
        {words: "спів кашалотів і крик химер", time: 37},
        {words: "поява запахів і кольорів", time: 40},
        {words: "коріння трав і листя дерев", time: 42},
        {words: "озерні льоди і пташиний свист", time: 44},
        {words: "руди і вугілля натруджений трем", time: 46},
        {words: "слухняних тварин шепіт і рев", time: 48},
        {words: "жага лунких торговельних міст", time: 50},
        {words: "вогонь, що спалює кораблі", time: 53},
        {words: "смерть на темних шовках знамен", time: 55},
        {words: "згаслі зірки на високому тлі", time: 57},
        {words: "тихі мерці в літній землі", time: 59},
        {words: "кров, ніби лава в покладах вен", time: 61},
        {words: "прийде все, що мало прийти,<br> і зникне все, що колись було", time: 64},
        {words: "мито за явлені їм світи", time: 69},
        {words: "голос із домішками темноти", time: 72},
        {words: "видиху вивільнене тепло", time: 74},
        {words: "ім'я, зіткане з приголосних і гірких голосних", time: 80},
        {words: "ніжності сутінковий сніг", time: 85},
        {words: "любові смарагдова течія", time: 88},
      ]
    },
    {
      video: "3OizzOMfCH8", words: ["нічого", "любові", "ніжності", "ночами", "нічого"],
      text: [
        {words: "що з того, що нічого не зрозуміло? ", time: 0},
        {words: "що з того, що знову доводиться все починати?", time: 4},
        {words: "кожна душа обживає собі якесь тіло,<br />і кожні двері ведуть до якоїсь кімнати", time: 7},
        {words: "кожен простір повен своїми радіопередачами", time: 13},
        {words: "з кожного серця ростуть водорості й квіти", time: 16},
        {words: "що з того, що вже тепер можна все передбачити?", time: 19},
        {words: "що з того, що ніколи не знаєш, як про це говорити?", time: 23},
        {words: "ці сутінки цілодобові", time: 27},
        {words: "як боротися з приступами й травмами", time: 29},
        {words: "лишилось ще стільки любові", time: 33},
        {words: "стільки любові, що я міг би спинити чуму під міськими брамами", time: 36},
        {words: "як вигасає вогонь у жіночому голосі", time: 40},
        {words: "я сам носив усю цю отруту в своїх кишенях", time: 43},
        {words: "стільки ніжності й злості", time: 47},
        {words: "стільки ніжності й злості, що я міг би підіймати з могил повішених і прокажених", time: 50},
        {words: "йшли за мною золотими ночами втомлені клоуни, безборонні сновиди", time: 54},
        {words: "що з того, що не знаєш із чого почати?", time: 58},
        {words: "і що з того, що в нас із тобою нічого не вийде?", time: 61},
        {words: "вона слухає мене, легко погойдуючись", time: 65},
        {words: "виходить кудись, потім повертається знову", time: 68},
        {words: "мовчить, у всьому зі мною погоджуючись", time: 71},
        {words: "усміхається, не вірячи жодному моєму слову", time: 74},
      ]
    },
    {
      video: "n4eh6T8S9lA", words: ["ніч", "любов"],
      text: [
        {words: "я з нею познайомився цілком випадково", time: 0},
        {words: "просто побачив, як вона відважно дивиться вгору", time: 6},
        {words: "в розмові її такі раптові та несумісні імена поетів, про яких вона постійно говорить", time: 9},
        {words: "мовби навмисно зчиняє вуличний галас", time: 17},
        {words: "ніби вона цілу ніч плакала чи цілувалась", time: 22},
        {words: "якщо це від сліз чи цілунків, а, скажімо, не від імен поетів", time: 26},
        {words: "наскільки це залежить від її колишніх стосунків", time: 29},
        {words: "наскільки це залежить від її колишніх стосунків, від її дорослих образ і дитячих секретів", time: 32},
        {words: "від чого залежить стукіт її черевиків", time: 35},
        {words: "від чого залежить стукіт її черевиків, її переможний сміх і точні цитати", time: 37},
        {words: "щоночі примушує її плакати і читати", time: 42},
        {words: "все так чи інакше залежить від найтоншої дії", time: 44},
        {words: "все так чи інакше залежить від римування", time: 55},
        {words: "все так чи інакше вплетене в теплий звукопис", time: 58},
        {words: "кожна її любов – виснажливе листування", time: 61},
        {words: "кожне її нещастя – геніальний рукопис", time: 64},
  ],
    },
    {
      video: "yRyw_49rojA", words: ["любов", "ніжність", "вночі"],
      text: [
        {words: "малюєш увесь час", time: 0},
        {words: "чому жінки в тебе завжди плачуть", time: 17},
        {words: "плачуть за вітром, який ховався в їхньому волоссі", time: 20},
        {words: "плачуть за зібраним виноградом, від якого терпкими були їхні язики", time: 24},
        {words: "золоті скорпіони непослуху", time: 34},
        {words: "ніхто не зуміє їх втішити", time: 36},
        {words: "любов чоловіків і жінок – це отримані нами ніжність та безпорадність", time: 39},
        {words: "довгий перелік дарунків і втрат", time: 44},
        {words: "занурення вітру в травневе волосся", time: 46},
        {words: "як гірко покладатись на того, кому довіряєш", time: 49},
        {words: "як солодко розчаровуватись у тому, хто торкався вночі", time: 53},
        {words: "є речі примхливі й небачені", time: 57},
        {words: "як би не розфарбовував їх, виходить завжди те саме", time: 60},
        {words: "зірка висить над тобою", time: 63},
        {words: "повітря перекипає теплом", time: 65},
        {words: "скільки світла ховає в собі кожне жіноче горло", time: 67},
        {words: "скільки світла ховає в собі кожне жіноче горло, скільки ховає мороку", time: 70},
      ]
    },
    {
      video: "-tiFGV9eZJc", words: ["нічого", "любові", "ніч", "ніжності"],
      text: [
        {words: "адже все залежить від нас", time: 0},
        {words: "торкаєшся повітряної оболонки, зрушуєш рівновагу", time: 23},
        {words: "все, втрачене нами, все віднайдене", time: 27},
        {words: "все повітря, прокачане через волинки легень", time: 29},
        {words: "який це все має сенс без нашого болю й розчарування", time: 32},
        {words: "яку це має вагу без нашої втіхи", time: 36},
        {words: "адже все стосується твоїх пальців", time: 39},
        {words: "нічого не можна буде повернути назад", time: 43},
        {words: "назване одного разу ім’я", time: 47},
        {words: "назване одного разу ім’я переінакшує голоси", time: 49},
        {words: "назване одного разу ім’я переінакшує голоси, переплітає корені слів", time: 51},
        {words: "битися над мертвими мовами, намагаючись за їхньою допомогою порозумітись із живими", time: 54},
        {words: "за кожним словом, за кожним вчинком стоїть неможливість повернення", time: 63},
        {words: "відвага й смуток рухають нами", time: 68},
        {words: "незворотність любові", time: 71},
        {words: "невідчитаність більшості з темних пророцтв і передбачень", time: 73},
        {words: "з нами стається лише те, чого ми хотіли", time: 77},
        {words: "чого ми хотіли, або те, чого ми боялись", time: 80},
        {words: "бажання чи страх", time: 83},
        {words: "ніч буде дзвеніти від музики в перетинках наших пальців", time: 86},
        {words: "кімната буде наповнюватися світлом із принесених словників", time: 90},
        {words: "все полягає на вмінні говорити мертвою мовою ніжності", time: 94},
        {words: "світло складається з темряви", time: 99},
        {words: "світло складається з темряви, і залежить лише від нас", time: 101},
      ]
    },
    {
      video: "2s5W5dxcs2w", words: ["любові", "любов", "ніч", "нічний"],
      text: [
        {words: "що робити зі священиками", time: 0},
        {words: "мов худобу, випасають свої церкви", time: 5},
        {words: "церкви важко лягають у річковий мул", time: 10},
        {words: "ходять за церквами, виганяючи їх із чужої пшениці", time: 15},
        {words: "сплять на мішках і книгах", time: 23},
        {words: "слухаючи сонне дихання тварин", time: 25},
        {words: "уві сні згадуючи обличчя жінок", time: 27},
        {words: "уві сні згадуючи обличчя жінок, що приходили й розповідали про найпотаємніші гріхи", time: 30},
        {words: "уві сні згадуючи обличчя жінок, що приходили й розповідали про найпотаємніші гріхи, питались поради, чекали на прощення", time: 33},
        {words: "що він може тобі порадити", time: 36},
        {words: "все його життя — випасання луни", time: 38},
        {words: "все його життя — випасання луни, пошук пасовищ і ночівля під чорним небом", time: 40},
        {words: "можеш співати з ним разом", time: 43},
        {words: "можеш спати поруч із ним, накрившись піхотинським плащем", time: 45},
        {words: "прати в ріці свої сорочки, які він готовий вивішувати в церкві, як плащаниці", time: 52},
        {words: "що робити з атеїстами", time: 59},
        {words: "насправді я вірю, вірю в усе, що було сказано", time: 62},
        {words: "ніколи й нізащо, за жодних обставин, в жодному разі в цьому не признаюся", time: 65},
        {words: "це моя справа, і стосується вона лише мене", time: 71},
        {words: "хай він сто разів при цьому ображається й погрожує", time: 75},
        {words: "хай він сто разів при цьому ображається й погрожує, гнівається й відвертається на своєму розп’ятті", time: 78},
        {words: "куди він без мене", time: 80},
        {words: "що він робитиме сам", time: 82},
        {words: "мусить боротися за мою присутність", time: 84},
        {words: "приречений битися за моє спасіння", time: 87},
        {words: "не може не рахуватися з моїми сумнівами, з моєю непослідовністю, з моєю щирістю", time: 89},
        {words: "що робити з тобою", time: 96},
        {words: "можеш співати разом із нами", time: 98},
        {words: "можеш співати разом із нами, ставати з нами в коло, класти руки нам на плечі", time: 100},
        {words: "ми єдині в нашому співі", time: 104},
        {words: "єдині в нашій любові, в нашій самотності, в нашому розчаруванні", time: 106},
        {words: "що робити з нами всіма", time: 110},
        {words: "більше часу на наші прикрості й наші знамення", time: 122},
        {words: "любов нищить усі наші уявлення про рівновагу", time: 126},
        {words: "можемо забуватись і відступати вбік", time: 129},
        {words: "можемо відмовлятися від того, що говорили", time: 132},
        {words: "можемо цілувати ніч у чорні губи", time: 135},
        {words: "ми єдині, кого торкався нічний вогонь", time: 137},
        {words: "ми єдині, хто вірить", time: 140},
        {words: "ми єдині, хто ніколи в цьому не признається", time: 142},
        {words: "говорити про все, що тобі сниться", time: 144},
        {words: "можеш говорити, можеш не боятися темряви", time: 148},
        {words: "хто-небудь тебе почує", time: 152},
        {words: "все одно хто-небудь тебе почує, все одно ніхто тобі не повірить", time: 154},
      ]
    },
    {
      video: "SNlqQ57-JQg", words: ["ночі", "ніч", "ніжно", "нічого", "ніч"],
      text: [
        {words: "місто, в якому вона заховалася", time: 0},
        {words: "місто, в якому вона заховалася, горить прапорами, лежить під засніженими перевалами", time: 29},
        {words: "мисливці виганяють дичину з протестантських соборів", time: 32},
        {words: "блакитні зорі падають в озера, убиваючи непоквапливу рибу", time: 35},
        {words: "вулиці, над якими зависають канатохідці", time: 39},
        {words: "як вони балансують за шкільними вікнами", time: 43},
        {words: "як ухиляються від озерних чайок", time: 46},
        {words: "там, де ми з нею колись жили", time: 53},
        {words: "там, де ми з нею колись жили, ми не мали часу на спокій і споглядання", time: 55},
        {words: "ми билися об гострий очерет ночі", time: 57},
        {words: "скидали баласт до чорної шахти ліфта, аби протриматися у повітрі ще одну ніч", time: 59},
        {words: "ненавидячи і не пробачаючи", time: 65},
        {words: "не приймаючи й не вірячи", time: 67},
        {words: "гнівно переживаючи найкращі дні свого життя", time: 69},
        {words: "місто, в якому вона нарешті сховалася", time: 73},
        {words: "місто, в якому вона нарешті сховалася, торкає її ніжно з а руку", time: 75},
        {words: "порти, куди сходять вивезені в трюмах сенегальці", time: 80},
        {words: "гостинні протестантські міста, в яких можна пересидіти страшний суд", time: 90},
        {words: "такі тут навчені адвокати, такі неприступні мури", time: 94},
        {words: "отам, де ми з нею колись грілися на кухнях, біля синіх джерел вогню", time: 98},
        {words: "по нас не лишилося жодного сліду", time: 102},
        {words: "час старий канатоходець", time: 106},
        {words: "час, старий канатоходець, сто разів падав, сто разів підіймався, зі зламаними ключицями, із залізними зубами", time: 108},
        {words: "йому без різниці, в якому напрямку рухатись", time: 112},
        {words: "залиже рани, і знову танцює між чайками", time: 115},
        {words: "місто, в якому вона змогла заховатись", time: 119},
        {words: "які тут барвисті сукні та сорочки", time: 122},
        {words: "оксамитова шкіра у пілотів і китайських студенток", time: 124},
        {words: "це свіже гірське повітря", time: 129},
        {words: "це відчуття крові після виснажливих поцілунків", time: 131},
        {words: "вона нічого не забула там, звідки поїхала", time: 135},
        {words: "жодного голосу, жодного прокляття", time: 138},
        {words: "життя – це веселе перетягання линви", time: 140},
        {words: "з одного боку її тягнуть янголи, з іншого – адвокати", time: 144},
      ]
    },
    {
      video: "lhtdHMEPHCM", words: ["ніч", "любов", "ночей"],
      text: [
        {words: "Святий Франциск збудував це місто для серферів і героїв", time: 0},
        {words: "у тихих бухтах, над якими стояли тумани", time: 19},
        {words: "іспанці зістрибували на берег", time: 23},
        {words: "російські моряки в рятувальних човнах", time: 25},
        {words: "золотошукачі з Китаю прошивали ніч ліхтарями", time: 27},
        {words: "кожна закладена церква була як натруджений голос", time: 32},
        {words: "свободи стане всім, якщо ви не будете тримати її для себе", time: 36},
        {words: "діліться хлібом і вугіллям на зиму", time: 40},
        {words: "дивіться на сонце крізь пляшкове скло океану", time: 42},
        {words: "золота вистачить на всіх", time: 45},
        {words: "любов дістанеться лише найсміливішим", time: 47},
        {words: "тисячі років потрібно для того, аби вибрати з землі всі щедроти", time: 51},
        {words: "тисячі ночей необхідно, аби вивчити звички місцевої скумбрії", time: 55},
        {words: "тисячі слів потребує той, хто говорить із вічністю", time: 59},
        {words: "чума сходить у святковий порт", time: 63},
        {words: "висипають із костелів дівчата й підлітки, зухвалі й золотошкірі", time: 66},
        {words: "діліться книгами та яскравим одягом", time: 75},
        {words: "діліться кавою та овочами", time: 78},
        {words: "в цьому місті ми всі захищені молами та фортечними стінами", time: 80},
        {words: "стільки втіхи привезено сюди з цілого світу", time: 84},
        {words: "що нам робити з нею", time: 87},
        {words: "святий Франциск охороняє її, коли вона з’являється тут на конференціях чи в бібліотеках", time: 91},
        {words: "охороняє від ворогів, охороняє від друзів", time: 104},
        {words: "ділися з нею своїм терпінням, ділися втомою, ділися радістю", time: 109},
        {words: "в цьому місті на кого їй ще покластися, як не на тебе", time: 114},
        {words: "в цьому житті про кого нам із тобою ще говорити, як не про неї", time: 118},
        {words: "в цьому житті про кого нам із тобою ще говорити, як не про неї, кого нам іще охороняти, кого ревнувати, Франциску", time: 120},
      ]
    },
    {
      video: "HhigglJapp0", words: ["любові"],
      text: [
        {words: "ось знову я пишу про неї", time: 0},
        {words: "розповідаю про балкони та її домашні розмови", time: 20},
        {words: "між сторінок антологій усіх тих проклятих поетів, котрі старанно псували нам життя", time: 27},
        {words: "сталось щось із моїм серцем", time: 35},
        {words: "сталось щось із моїм серцем, воно почало дрейфувати, мов корабель, команда якого померла від лихоманки", time: 38},
        {words: "рухалось углибині мого дихання, підхоплене течією, атаковане акулами", time: 44},
        {words: "серце, жодні вітрила й канати не допоможуть тобі", time: 50},
        {words: "сузір’я висять надто високо", time: 56},
        {words: "сузір’я висять надто високо, аби можна було знайти дорогу", time: 58},
        {words: "забагато чоловіків наймалось у твої команди", time: 61},
        {words: "забагато їх сходило в британських портах, гублячи душі зеленим вогнем алкоголю", time: 65},
        {words: "серце, хворе на лихоманку", time: 76},
        {words: "серце, хворе на лихоманку, одужуй скоріше, йди на поправку", time: 120},
        {words: "ще стільки пекучої любові чекає на нас", time: 122},
        {words: "ще стільки прекрасних трагедій приховано від нас у відкритому морі", time: 126},
        {words: "серце, мені так радісно слухати, як ти б’єшся", time: 130},
        {words: "серце, мені так радісно слухати, як ти б’єшся, схоже на лисицю – пійману, але не приручену", time: 135},
      ]
    },
    {
      video: "WcK1UBkaYlk", words: ["нічого", "нічого"],
      text: [
        {words: "як добре", time: 0},
        {words: "я для неї помер", time: 13},
        {words: "вона забула моє ім’я", time: 15},
        {words: "все це сталося саме тепер", time: 18},
        {words: "при цьому всьому не був присутній я", time: 21},
        {words: "вона вирішила все за нас", time: 24},
        {words: "не мусив переконувати її не робити дурниць", time: 27},
        {words: "вона вагається раз у раз", time: 31},
        {words: "не мусив при цьому бачити її темних зіниць", time: 34},
        {words: "зникнути, вибравши вірний маршрут", time: 38},
        {words: "не повертатись туди, де раніше жив", time: 41},
        {words: "не підходити близько до знайомих споруд", time: 44},
        {words: "не лякати знайомих, не розчаровувати чужих", time: 47},
        {words: "не забрідати до їхніх снів, не торкатись їхніх речей", time: 50},
        {words: "не гортати їхніх книг, не пити їхнє вино", time: 55},
        {words: "не чути їхнього дихання, не бачити їхніх очей", time: 58},
        {words: "не відчувати того, що вони самі не відчувають давно", time: 62},
        {words: "можна тепер вилітати крізь коминИ", time: 67},
        {words: "проходити крізь вогонь, падати у траву", time: 70},
        {words: "відчувати плавку матерію, яка наповнює її сни", time: 73},
        {words: "помічати в повітрі линви, що тримають її на плаву", time: 77},
        {words: "смерть не належить ні до надбань, ні до втрат", time: 80},
        {words: "нас не зраджують наші сліди", time: 84},
        {words: "нічого не можна повернути назад, нічого не можна втратити назавжди", time: 87},
        {words: "зелене тепло", time: 95},
        {words: "вечірнього неба помаранчеве тло", time: 97},
        {words: "золоті місяцІ, блакитні риби в ріці, чорні тіні на її лиці", time: 99}
      ],
    },
    {
      video: "MczhhwCUqGc", words: ["вночі", "війна"],
      text: [
        {words: "завжди повертатись на ці пагорби й ріки", time: 0},
        {words: "завжди повертатись на ці пагорби й ріки, де при брамах стоять митарі й охоронці", time: 26},
        {words: "євангелісти в церквах тут мають такі темні лики, ніби цілими днями збирають виноград на сонці", time: 29},
        {words: "чоловіки тут носять на собі стільки золота, що смерті незручно забирати їх із собою", time: 35},
        {words: "жінок уночі торкає чорна гризота, і вони малюють очі фарбою голубою", time: 41},
        {words: "діти тут змалку вивчають такі небезпечні ремесла, що, виростаючи, так і лишаються безробітними", time: 47},
        {words: "кожна війна для них, як манна небесна", time: 53},
        {words: "загиблих героїв завжди прикрашають квітами", time: 56},
        {words: "фури з Півдня ввозять до міста заразу", time: 59},
        {words: "опівночі жебраки підраховують втрати", time: 62},
        {words: "всіх пам’ятати й завжди сюди повертатись", time: 67},
        {words: "ось осінь", time: 71},
        {words: "ось осінь – ще не помітна", time: 72},
        {words: "ось вечірні дерева, мов полкові знамена", time: 74},
        {words: "ось її темний будинок, ось її вікна", time: 77},
        {words: "можливо, вона чекає, можливо, навіть на мене", time: 80},
      ],
    },
    {
      video: "2n36oF3L4Zk", words: ["ніжні"],
      text: [
        {words: "влітку вона ходить кімнатами, ловить вітер у кватирках", time: 0},
        {words: "підстерігає протяги, ставить на них пастки", time: 17},
        {words: "протяги говорять їй", time: 20},
        {words: "надто ніжні твої рухи", time: 21},
        {words: "надто ніжні твої рухи, надто гаряча кров", time: 23},
        {words: "з такою витримкою що ти можеш піймати в житті", time: 25},
        {words: "надто високо ти здіймаєш долоні, ловлячи пустоту", time: 28},
        {words: "все, що вилетіло нам із рук, — лише порожнеча", time: 32},
        {words: "все, на що не стає терпіння, — лише вітер, який літає над містом", time: 36},
        {words: "сонце в ранковому небі схоже на апельсин у шкільному ранці", time: 40},
        {words: "єдине, що має справжню вагу", time: 44},
        {words: "єдине, про що думаєш, коли стає особливо самотньо", time: 47},
      ],
    },
    {
      video: "OZ5wp8uBcnk", words: ["нічого"],
      text: [
        {words: "слова, якими можна все пояснити, завжди прості", time: 0},
        {words: "ти просто ще один голос в її житті", time: 31},
        {words: "не зрозуміло, що вас тримає разом", time: 43},
        {words: "що вас тримає, окрім страху", time: 48},
        {words: "що вас тримає, окрім страху втратити один одного", time: 51},
        {words: "тримати разом таку рвану тканину прозрінь, перевтілень і марень", time: 53},
        {words: "що тримає в повітрі невагомий цей апарат", time: 57},
        {words: "чиє крило торкається кожної з ваших утрат", time: 61},
        {words: "чий політ невагомий, чиє дрейфування марне", time: 64},
        {words: "речі, заради яких помирають, стосуються саме життя", time: 68},
        {words: "речі, заради яких помирають, стосуються саме життя, стосуються невагомості, стосуються опертя", time: 72},
        {words: "всі вагання твої, всі твої сумніви, всі варіанти рятунку", time: 83},
        {words: "життя заслуговує захвату все одно", time: 89},
        {words: "Господь забув про неї давно", time: 91},
        {words: "Господь забув про неї давно – йому вистачає турбот і не вистачає удачі", time: 93},
        {words: "не варто боятися смерті й пустоти", time: 97},
        {words: "Бог бачить ті самі речі, що бачиш і ти", time: 99},
        {words: "Бог бачить ті самі речі, що бачиш і ти, просто він запам’ятовує те, що бачить", time: 102},
        {words: "у всьому винен насправді ти", time: 108},
        {words: "Бог ховається у великому", time: 114},
        {words: "Бог – це пітьма", time: 116},
        {words: "я бачив його, я говорив йому, що його нема", time: 118},
        {words: "співай, Маріє, співай", time: 124},
        {words: "співай, Маріє, співай, не став незручних питань", time: 126},
        {words: "смерть не міняє звичок і вподобань", time: 128},
        {words: "смерть міняє квитки і дорожні карти", time: 130},
        {words: "щось мені не страшно на цьому страшному суді", time: 133},
        {words: "після життя в розбитій країні на хлібі й воді", time: 136},
        {words: "після життя в розбитій країні на хлібі й воді хто мене може судити і чим мене можна злякати", time: 139},
        {words: "хто мене може судити і чим мене можна злякати", time: 141},
        {words: "співайте, гарпунники, серед моря йдучи на дно", time: 143},
        {words: "співайте, вигнанці, про те, що вам все одно", time: 147},
        {words: "віра – це те, що тримає тебе в сідлі", time: 153},
        {words: "віра – це те, що тримає тебе в сідлі навіть тоді, коли твої шанси такі малі, що від тебе нічого не хочуть навіть твої командири", time: 156},
        {words: "буде квітнути верес і чорна трава", time: 162},
        {words: "з тобою завжди будуть твої права, подяки в кінці й присвяти на першій сторінці", time: 165},
        {words: "з тобою завжди будуть її голоси", time: 171},
      ],
    },
    {
      video: "XMOLFfSZ5zE", words: ["любов", "нічні", "ніжність"],
      text: [
        {words: "з чого все почалося", time: 0},
        {words: "вона заговорила про мужність і зброю", time: 16},
        {words: "в неї навіть не голос – в неї багатоголосся", time: 19},
        {words: "коли вона говорила, мені взагалі здалося, що вона розмовляє сама з собою", time: 22},
        {words: "так складаючи свої літери й звуки, що кожне слово спалахувало й мерехтіло", time: 28},
        {words: "навіть коли говорила про ефірні сполуки, здавалося, що переказує Христові муки", time: 33},
        {words: "співаючи там, де було зовсім незрозуміло", time: 39},
        {words: "в кожному з нас є невід’ємна відвага", time: 45},
        {words: "історія – це лише мертві міста й могильні плити", time: 48},
        {words: "майбутнє – це чорна земля й червоні метеорити", time: 53},
        {words: "любов – це вправи для дихання", time: 56},
        {words: "потрібно змагатися за можливість разом засинати", time: 60},
        {words: "ламати ворожі шеренги за можливість разом прокидатись", time: 64},
        {words: "лишати разом із нею балкони й нічні кімнати, ранити шкіру долонь об залізні канати, цінуючи здатність любити ніби найвищу здатність", time: 68},
        {words: "цінуючи здатність любити ніби найвищу здатність", time: 74},
        {words: "в її неправді була своя міра", time: 78},
        {words: "її чекали попереду радість і вірність", time: 81},
        {words: "кров, запечена на рукаві мундира", time: 83},
        {words: "що тримає птахів угорі –  очевидно, віра", time: 87},
        {words: "що тримає рибу в ріці – очевидно, ніжність", time: 90},
      ],
    },
    {
      video: "4h8kJWzfE74", words: ["любов", "ніжність"],
      text: [
        {words: "чому я не веду щоденник", time: 0},
        {words: "минуле розпадеться на отвори та довгі коридори", time: 16},
        {words: "почуватись так, ніби серце твоє відірвалось, але не перестало битись", time: 28},
        {words: "я знаю чого чекати ближчим часом від богів та демонів", time: 59},
        {words: "це початок весни, а отже все має змінитися", time: 63},
        {words: "не можна буде робити вигляд, ніби все лишається як є", time: 72},
        {words: "зміниться все", time: 76},
        {words: "зміниться розташування серця в моєму тілі, зміняться його звички й поведінка", time: 78},
        {words: "зміниться мій почерк – він стане більш гострим та нерозбірливим", time: 93},
        {words: "як вона може щось зауважити", time: 101},
        {words: "в неї це все, очевидно, відбувається якось інакше", time: 107},
        {words: "все станеться так, як мало статися, все триватиме стільки, скільки я сам цього захочу", time: 112},
        {words: "не певен, чи справді добре було б знати все наперед", time: 118},
        {words: "найпрекрасніші моменти цього життя трапляються з нами спонтанно", time: 126},
        {words: "найпрекрасніші моменти цього життя трапляються з нами спонтанно, найпечальніші так само", time: 130},
        {words: "десь підсвідомо, десь на рівні серця, що не знаходить собі місця", time: 132},
        {words: "найважче проектуються речі прості", time: 142},
        {words: "найважче проектуються речі прості й добре знайомі – любов, ніжність, забуття, смерть", time: 145},
        {words: "все одно не зможеш потім розібрати власний почерк", time: 152},
      ],
    },
    {
      video: "2s5W5dxcs2w", words: ["нічних", "вночі"],
      text: [
        {words: "сніги собі минають", time: 0},
        {words: "в зеленій млі травневої пори жінки на кухнях зупиняють час", time: 30},
        {words: "в зеленій млі травневої пори жінки на кухнях зупиняють час і варять місяці, немов сири", time: 35},
        {words: "теплий дим нічних приготувань", time: 38},
        {words: "найтяжче із тривань лишає лише кола на ріці", time: 43},
        {words: "кожен місяць має свій куток", time: 52},
        {words: "кожен місяць має свій куток поміж ножів, шухляд і терезів", time: 55},
        {words: "назви їхні – довгі, мов ковток, вологий від жіночих голосів", time: 57},
        {words: "іще легкі від співів і плачів", time: 65},
        {words: "жінки виносять їх на береги для біженців, убивць і втікачів", time: 68},
        {words: "сонця рибалок, зорі пастухів", time: 73},
        {words: "переливають світло, наче спів", time: 76},
        {words: "всі жінки тримаються імли", time: 90},
        {words: "втрачають вдень і згадують вночі секрети, котрі їм передали гравери, антиквари і ткачі", time: 93},
        {words: "стояти довго при вогні, настоюючи тисячі отрут", time: 101},
        {words: "допоки мул лежить на глибині й холоне тиша на дахах споруд", time: 105},
        {words: "холоне тиша на дахах споруд", time: 108},
        {words: "доки стане їхніх місяців і стане світла кожному із них", time: 111},
        {words: "росте трава, проймаючи мерців", time: 117},
        {words: "росте трава, проймаючи мерців, росте трава, тримаючи живих", time: 120},
        {words: "росте трава, тримаючи живих", time: 125},
        {words: "жінки, що живуть за рікою", time: 143},
        {words: "за рікою, де мулистий ґрунт і червоною цеглою мощені вулиці", time: 145},
        {words: "що вода принесе їм цього ранку", time: 151},
        {words: "пущені за течією кошики з городиною та немовлятами", time: 155},
        {words: "вода складається з таємниць", time: 159},
        {words: "потрібно вважати, аби тебе не затягло до глибоких колодязів", time: 162},
        {words: "де чекають примари з риб’ячими головами, з ніжними хвостами", time: 166},
        {words: "закохані й зраджені", time: 170},
        {words: "якби існували мости", time: 173},
        {words: "якби можна було перебратися на той бік", time: 175},
        {words: "якби можна було перебратися на той бік, я давно був би уже там", time: 177},
        {words: "забути про тебе", time: 180},
        {words: "знаходячи сліди твоїх нігтів на передпліччі", time: 182},
        {words: "згадати твоє лице", time: 185},
        {words: "ти завжди просила вимкнути світло", time: 187},
        {words: "на цих берегах, за цехами й котельнями, горять небеса", time: 190},
        {words: "померлі дівчата в строкатих циганських спідницях стоять у повітрі над дахами", time: 194},
        {words: "зазираючи у комини, співаючи в них, мов у старі лампові мікрофони", time: 199},
        {words: "жінки, що живуть на іншому березі", time: 210},
        {words: "щовечора ховаються в розлитому яблуневому золоті", time: 215},
        {words: "скидають свої невагомі сукні", time: 230},
        {words: "витягають з волосся шпильки та отруєні гребені", time: 232},
        {words: "хто потрапив сюди, буде щоденно рибалити", time: 236},
        {words: "закидаючи сіті серед туману", time: 239},
        {words: "класти їм до ніг червоні серця, вириваючи їх із рибин, мов тюльпани", time: 242},
        {words: "якби лише можна було потрапити на той берег", time: 248},
        {words: "пройти повз холодну тінь електричної станції", time: 252},
        {words: "побачити птахів, які тягають із підвіконь сережки й натільні хрестики", time: 255},
        {words: "відчути, як уночі з ріки виходить морок", time: 260},
        {words: "відчути, як уночі з ріки виходить морок, знати, що на ранок він відступить назад", time: 263},
      ],
    },
    {
      video: "rBMrX4gfwwI", words: ["ніжними", "вночі"],
      text: [
        {words: "жінки, що живуть за рікою", time: 0},
        {words: "за рікою, де мулистий ґрунт і червоною цеглою мощені вулиці", time: 5},
        {words: "що вода принесе їм цього ранку", time: 11},
        {words: "пущені за течією кошики з городиною та немовлятами", time: 15},
        {words: "вода складається з таємниць", time: 19},
        {words: "потрібно вважати, аби тебе не затягло до глибоких колодязів", time: 22},
        {words: "де чекають примари з риб’ячими головами, з ніжними хвостами", time: 26},
        {words: "закохані й зраджені", time: 30},
        {words: "якби існували мости", time: 33},
        {words: "якби можна було перебратися на той бік", time: 35},
        {words: "якби можна було перебратися на той бік, я давно був би уже там", time: 37},
        {words: "забути про тебе", time: 40},
        {words: "знаходячи сліди твоїх нігтів на передпліччі", time: 42},
        {words: "згадати твоє лице", time: 45},
        {words: "ти завжди просила вимкнути світло", time: 47},
        {words: "на цих берегах, за цехами й котельнями, горять небеса", time: 50},
        {words: "померлі дівчата в строкатих циганських спідницях стоять у повітрі над дахами", time: 54},
        {words: "зазираючи у комини, співаючи в них, мов у старі лампові мікрофони", time: 59},
        {words: "жінки, що живуть на іншому березі", time: 70},
        {words: "щовечора ховаються в розлитому яблуневому золоті", time: 75},
        {words: "скидають свої невагомі сукні", time: 80},
        {words: "витягають з волосся шпильки та отруєні гребені", time: 82},
        {words: "хто потрапив сюди, буде щоденно рибалити", time: 86},
        {words: "закидаючи сіті серед туману", time: 89},
        {words: "класти їм до ніг червоні серця, вириваючи їх із рибин, мов тюльпани", time: 92},
        {words: "якби лише можна було потрапити на той берег", time: 98},
        {words: "пройти повз холодну тінь електричної станції", time: 102},
        {words: "побачити птахів, які тягають із підвіконь сережки й натільні хрестики", time: 105},
        {words: "відчути, як уночі з ріки виходить морок", time: 110},
        {words: "відчути, як уночі з ріки виходить морок, знати, що на ранок він відступить назад", time: 113},
      ],
    },
    {
      video: "n4eh6T8S9lA", words: ["нічних", "любов"],
      text: [],
    },
    {
      video: "3OizzOMfCH8", words: ["любов’ю"],
      text: [],
    },
    {
      video: "???????", words: ["ніч", "любов"],
      text: [],
    }
  ];

  function initUI() {
    slots = $(".slot")
    circle = $("#circle")
    play = $('#play')

    updateUI(true)

    $('#field').droppable({
      drop: function(event, ui) {
        var el = $(ui.draggable);

        el.data('dropped-in-circle', true);
        if (el.data('was-in-circle')) {
          return;
        }
        el.data('was-in-circle', true);

        var offset = circle.offset();
        var parentOffset = el.parent().offset();
        var cssTop = parseInt(el.css('top'), 10);
        var cssLeft = parseInt(el.css('left'), 10);
        var top = parentOffset.top + cssTop - offset.top + parseInt(circle.css('marginTop'), 10);
        var left = parentOffset.left + cssLeft - offset.left + parseInt(circle.css('marginLeft'), 10);
        
        el.appendTo(circle);
        el.css({'top' : top, 'left' : left, 'position': 'absolute'});
        updateUI();
      }
    });
  }

  function makeWordsDraggable() {
    $('.word:not(.ui-draggable)').draggable({
      start: function(event, ui) {
        $(ui.helper).data('dropped-in-circle', false);
      },
      stop: function(event, ui) {
        var el = $(ui.helper)
        if (el.data('was-in-circle') && !el.data('dropped-in-circle')) {
          el.animate({opacity: 0}, 100, function(){
            el.remove();
          })
          updateUI();
        }
      },
    });
  }

  function updateUI(noReset) {
    if (noReset) {
      doUpdateUI()
    } else {
      resetUI(doUpdateUI)
    }
  }

  function doUpdateUI() {
    var newState = updateState()

    fillSlots(newState.suggestedWords);

    if (newState.combo) {
      circle.addClass("combo");
      play.attr('data-video-id', newState.combo);
    }

    makeWordsDraggable();
  }

  function fillSlots(suggWords) {
    var freeSlots = [], words = [];
    $(".slot").each(function(){
      var slot = $(this), word = slot.find('.word');
      if (suggWords.indexOf(word.attr('data-word')) > -1) {
        words.push(word.attr('data-word'));
        return;
      }

      word.remove();
      freeSlots.push(slot);
    });

    for (var i = 0; i < suggWords.length; i++) {
      if (words.indexOf(suggWords[i]) > -1) {
        continue;
      }
      var slot = freeSlots.shift();
      if (!slot) {
        continue;
      }
      var word = $("<div>").addClass("word").attr("data-word", suggWords[i]);
      var img = $("<img>").attr("src", images[suggWords[i]]);
      img.attr('data-at2x', images[suggWords[i]].replace('.png', '@2x.png'));
      word.append(img);
      slot.append(word);
      word.css({opacity: 0})
          .animate({opacity: 1}, 100);
    }

  }

  function resetUI(callback) {
    // slots.empty();
    circle.removeClass("combo");
    play.attr('data-video-id', '');
    callback();
  }

  function getCurrentWords() {
    var circleWords = [];
    circle.find(".word").each(function(){
      if ($(this).data('dropped-in-circle')) {
        circleWords.push($(this).attr('data-word'))
      }
    })
    return circleWords
  }

  function updateState() {
    var circleWords = getCurrentWords()
    return getState(circleWords);
  }

  function getState(circleWords) {

    var result = {  
      suggestedWords: [],
      combo: null,
    };

    if (circleWords.length == 0) {
      result.suggestedWords = mainWords;
      return result;
    }

    for (var i in combos) {
      var r = suggest(combos[i], circleWords);
      result.suggestedWords = result.suggestedWords.concat(r.suggestedWords);
      result.combo = result.combo || r.combo;
    }

    result.suggestedWords = uniqueWords(result.suggestedWords);

    return result;
  }

  function suggest(combo, circleWords) {
    var result = {  
      suggestedWords: [],
      combo: null
    };

    var comboCopy = [].concat(combo.words);

    for (var i in circleWords) {
      var idx = comboCopy.indexOf(circleWords[i]);
      if (idx == -1) {
        return result;
      }
      comboCopy.splice(idx, 1);
    }

    if (comboCopy.length == 0) {
      result.combo = combo.video;
    }

    result.suggestedWords = comboCopy;

    return result;
  }

  function uniqueWords(words) {
    var result = [];
    for (var i = 0; i < words.length; i++) {
      if (result.indexOf(words[i]) == -1) {
        result.push(words[i]);
      }
    }
    return result
  }

  function dropUI() {
    circle.find(".word").each(function(){
      $(this).remove()
    })
  }

  function getCurrentTrack (id) {
    return combos.filter(function (item) {
      return item.video == id
    })
  }

  // expose some stuff
  window.rozd = {
    initUI: initUI,
    dropUI: dropUI,
    updateUI:  updateUI,
    getState: getState,
    suggest: suggest,
    getCurrentTrack: getCurrentTrack,
    mainWords: mainWords,
  }
})()
