window.album2017 = {
    '0': { video: '3_VOPQ1B-F0', 
           text: 
            [
              {words: "вночі він написав їй повідомлення", time: 0},
              {words: "коли над вулицями в липкому повітрі проносяться демони", time: 15},
              {words: "дим на кухнях гусне, пахнучи маком і шоколадом", time: 19},
              {words: "серед бузкової ночі вогні її помешкання", time: 25},
              {words: "провалюється у свої сновидіння, ніби в крихкий і невагомий різдвяний сніг", time: 34},
              {words: "доки кристали морозу запікаються їй на вустах", time: 40},
              {words: "він несе свою вахту, охороняючи її спокій і розганяючи демонів своїми кубинськими сигаретами", time: 43},
              {words: "вулиці нині особливо лункі", time: 51},
              {words: "хочеться говорити тихо, щоби тебе ніхто не почув, а почувши – не зрозумів", time: 65},

              {words: "щє нічого немає", time: 83},
              {words: "зелена ніч, і в кожної тиші міра своя", time: 85},
              {words: "знаючи, скільки потрібно сторіч, щоби з'явилась найперша річ, він вимовляє її ім'я", time: 89},
              {words: "відчиняє нічне вікно і ловить напружено кожен рух", time: 96},
              {words: "сподіваючись на щось все одно", time: 101},
              {words: "небуття важке полотно покірно дається йому до рук", time: 104},
              {words: "гольфстріми, айсберги мертвих морів", time: 109},
              {words: "щоденний рух повітряних сфер", time: 113},
              {words: "спів кашалотів і крик химер", time: 116},
              {words: "поява запахів і кольорів", time: 118},
              {words: "коріння трав і листя дерев", time: 121},
              {words: "озерні льоди і пташиний свист", time: 124},
              {words: "руди і вугілля натруджений трем", time: 127},
              {words: "слухняних тварин шепіт і рев", time: 129},
              {words: "жага лунких торговельних міст", time: 132},
              {words: "вогонь, що спалює кораблі", time: 135},
              {words: "смерть на темних шовках знамен", time: 138},
              {words: "згаслі зірки на високому тлі", time: 140},
              {words: "тихі мерці в літній землі", time: 142},
              {words: "кров, ніби лава в покладах вен", time: 145},
              {words: "прийде все, що мало прийти, і зникне все, що колись було", time: 147},
              {words: "мито за явлені їм світи", time: 153},
              {words: "голос із домішками темноти", time: 156},
              {words: "видиху вивільнене тепло", time: 158},
              {words: "ім'я, зіткане з приголосних і гірких голосних", time: 166},
              {words: "ніжності сутінковий сніг", time: 173},
              {words: "любові смарагдова течія", time: 175},

              {words: "що з того, що нічого не зрозуміло?", time: 191},
              /*{words: "що з того, що знову доводиться все починати?", time: 5},
              {words: "кожна душа обживає собі якесь тіло, і кожні двері ведуть до якоїсь кімнати", time: 8},
              {words: "кожен простір повен своїми радіопередачами", time: 14},
              {words: "з кожного серця ростуть водорості й квіти", time: 17},
              {words: "що з того, що вже тепер можна все передбачити?", time: 19},
              {words: "що з того, що ніколи не знаєш, як про це говорити?", time: 24},
              {words: "ці сутінки цілодобові", time: 27},
              {words: "я знаю як", time: 29},
              {words: "як боротися з приступами й травмами", time: 31},
              {words: "лишилось ще стільки любові", time: 33},
              {words: "стільки любові, що я міг би спинити чуму під міськими брамами", time: 36},
              {words: "як вигасає вогонь у жіночому голосі", time: 40},
              {words: "я сам носив усю цю отруту в своїх кишенях", time: 43},
              {words: "стільки ніжності й злості", time: 47},
              {words: "стільки ніжності й злості, що я міг би підіймати з могил повішених і прокажених", time: 50},
              {words: "йшли за мною золотими ночами втомлені клоуни, безборонні сновиди", time: 54},
              {words: "що з того, що не знаєш із чого почати?", time: 58},
              {words: "і що з того, що в нас із тобою нічого не вийде?", time: 62},
              {words: "вона слухає мене, легко погойдуючись", time: 66},
              {words: "виходить кудись, потім повертається знову", time: 69},
              {words: "мовчить, у всьому зі мною погоджуючись", time: 72},
              {words: "усміхається, не вірячи жодному моєму слову", time: 74},*/

              {words: "я так ніколи й не навчуся", time: 371},

              {words: "я з нею познайомився цілком випадково", time: 442},
              /*{words: "просто побачив, як вона відважно дивиться вгору", time: 7},
              {words: "в розмові її такі раптові та несумісні імена поетів, про яких вона постійно говорить", time: 10},
              {words: "мовби навмисно зчиняє вуличний галас", time: 17},
              {words: "ніби вона цілу ніч плакала чи цілувалась", time: 22},
              {words: "якщо це від сліз чи цілунків, а, скажімо, не від імен поетів", time: 26},
              {words: "наскільки це залежить від її колишніх стосунків", time: 30},
              {words: "наскільки це залежить від її колишніх стосунків, від її дорослих образ і дитячих секретів", time: 32},
              {words: "від чого залежить стукіт її черевиків", time: 35},
              {words: "від чого залежить стукіт її черевиків, її переможний сміх і точні цитати", time: 37},
              {words: "щоночі примушує її плакати і читати", time: 42},
              {words: "все так чи інакше залежить від найтоншої дії", time: 45},
              {words: "все так чи інакше залежить від римування", time: 56},
              {words: "все так чи інакше вплетене в теплий звукопис", time: 59},
              {words: "кожна її любов – виснажливе листування", time: 62},
              {words: "кожне її нещастя – геніальний рукопис", time: 65},*/

              {words: "жінки наші мають дивну властивість", time: 552},

              //{words: "ті жінки", time: 684},

              {words: "малюєш увесь час", time: 861},
              /*{words: "чому жінки в тебе завжди плачуть", time: 17},
              {words: "плачуть за вітром, який ховався в їхньому волоссі", time: 20},
              {words: "плачуть за зібраним виноградом, від якого терпкими були їхні язики", time: 25},
              {words: "золоті скорпіони непослуху", time: 34},
              {words: "ніхто не зуміє їх втішити", time: 37},
              {words: "любов чоловіків і жінок – це отримані нами ніжність та безпорадність", time: 39},
              {words: "довгий перелік дарунків і втрат", time: 44},
              {words: "занурення вітру в травневе волосся", time: 47},
              {words: "як гірко покладатись на того, кому довіряєш", time: 49},
              {words: "як солодко розчаровуватись у тому, хто торкався вночі", time: 53},
              {words: "є речі примхливі й небачені", time: 58},
              {words: "як би не розфарбовував їх, виходить завжди те саме", time: 61},
              {words: "зірка висить над тобою", time: 64},
              {words: "повітря перекипає теплом", time: 66},
              {words: "скільки світла ховає в собі кожне жіноче горло", time: 68},
              {words: "скільки світла ховає в собі кожне жіноче горло, скільки ховає мороку", time: 70},*/

              {words: "адже все залежить від нас", time: 948},
              /*{words: "торкаєшся повітряної оболонки, зрушуєш рівновагу", time: 24},
              {words: "все, втрачене нами, все віднайдене", time: 28},
              {words: "все повітря, прокачане через волинки легень", time: 30},
              {words: "який це все має сенс без нашого болю й розчарування", time: 33},
              {words: "яку це має вагу без нашої втіхи", time: 37},
              {words: "адже все стосується твоїх пальців", time: 39},
              {words: "нічого не можна буде повернути назад", time: 43},
              {words: "назване одного разу ім’я", time: 48},
              {words: "назване одного разу ім’я переінакшує голоси", time: 49},
              {words: "назване одного разу ім’я переінакшує голоси, переплітає корені слів", time: 51},
              {words: "битися над мертвими мовами, намагаючись за їхньою допомогою порозумітись із живими", time: 54},
              {words: "за кожним словом, за кожним вчинком стоїть неможливість повернення", time: 63},
              {words: "відвага й смуток рухають нами", time: 69},
              {words: "незворотність любові", time: 72},
              {words: "невідчитаність більшості з темних пророцтв і передбачень", time: 74},
              {words: "з нами стається лише те, чого ми хотіли", time: 77},
              {words: "чого ми хотіли, або те, чого ми боялись", time: 80},
              {words: "бажання чи страх", time: 83},
              {words: "ніч буде дзвеніти від музики в перетинках наших пальців", time: 86},
              {words: "кімната буде наповнюватися світлом із принесених словників", time: 91},
              {words: "все полягає на вмінні говорити мертвою мовою ніжності", time: 95},
              {words: "світло складається з темряви", time: 99},
              {words: "світло складається з темряви, і залежить лише від нас", time: 102},*/

              {words: "вся правда має лишатися поза віршами", time: 1044},
            ]
         },
    '1': { video: 'HSWeR6Fhia0', 
           text: 
            [
              { words: 'куди підіймається ранкове повітря', time: 0 }
            ]
         },
    '2': { video: 'wufzprhjWfQ', 
           text: 
            [
              { words: 'немає нічого випадкового', time: 0 }
            ]
         },
    '3': { video: 'fpjx5drqZ0Q', 
           text: 
            [
              { words: 'пливи, рибо, пливи', time: 0 }
            ]
         }
};